# S&P500 Data + Interest Rate Data Logged

In [5]:
# imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# make one final dataset with rate_data and s&p 500 data
df = pd.read_csv("../00_data/sp500_full.csv", parse_dates=["date"])
df2 = pd.read_csv("../00_data/clean_data.csv", parse_dates=["Date"])

In [6]:
df.head()

        date       open       high      low      close
0 2015-12-31  2060.5901  2062.5400  2043.62  2043.9399
1 2015-12-30  2077.3401  2077.3401  2061.97  2063.3601
2 2015-12-29  2060.5400  2081.5601  2060.54  2078.3601
3 2015-12-28  2057.7700  2057.7700  2044.20  2056.5000
4 2015-12-24  2063.5200  2067.3601  2058.73  2060.9900

In [7]:
df2.head()

        Date  3 Mo  6 Mo  1 Yr  2 Yr  3 Yr  5 Yr  7 Yr  10 Yr
0 1990-01-02  7.83  7.89  7.81  7.87  7.90  7.87  7.98   7.94
1 1990-01-03  7.89  7.94  7.85  7.94  7.96  7.92  8.04   7.99
2 1990-01-04  7.84  7.90  7.82  7.92  7.93  7.91  8.02   7.98
3 1990-01-05  7.79  7.85  7.79  7.90  7.94  7.92  8.03   7.99
4 1990-01-08  7.79  7.88  7.81  7.90  7.95  7.92  8.05   8.02

In [8]:
df.rename(columns={"date": "Date"}, inplace=True)
numerical_columns = df.select_dtypes(include=[np.number]).columns.tolist()

# log the columns such that the data isn't skewed
# find better ideas to transform this
df[numerical_columns] = np.log(df[numerical_columns])
df.head()

        Date      open      high       low     close
0 2015-12-31  7.630748  7.631694  7.622478  7.622635
1 2015-12-30  7.638844  7.638844  7.631417  7.632091
2 2015-12-29  7.630723  7.640873  7.630723  7.639334
3 2015-12-28  7.629378  7.629378  7.622762  7.628761
4 2015-12-24  7.632169  7.634028  7.629845  7.630942

In [9]:
merged_df = pd.merge(df2, df, on="Date", how="inner")

print(merged_df.head())

        Date  3 Mo  6 Mo  1 Yr  2 Yr  3 Yr  5 Yr  7 Yr  10 Yr      open  \
0 1990-01-02  7.83  7.89  7.81  7.87  7.90  7.87  7.98   7.94  5.867601
1 1990-01-03  7.89  7.94  7.85  7.94  7.96  7.92  8.04   7.99  5.885243
2 1990-01-04  7.84  7.90  7.82  7.92  7.93  7.91  8.02   7.98  5.882654
3 1990-01-05  7.79  7.85  7.79  7.90  7.94  7.92  8.03   7.99  5.874003
4 1990-01-08  7.79  7.88  7.81  7.90  7.95  7.92  8.05   8.02  5.864199

       high       low     close
0  5.885243  5.863574  5.885243
1  5.887742  5.880226  5.882654
2  5.882654  5.866156  5.874003
3  5.874003  5.861783  5.864199
4  5.869975  5.859475  5.868704

In [10]:
merged_df = merged_df.sort_values(by="Date")

In [11]:
merged_df.to_csv("../00_data/clean_rate_sp500.csv", index=False)